[
  {
    "foodname": "hot dog",
    "ingredients": [
      "bread",
      "sausage",
      "mustard",
      "ketchup"
    ],
    "instructions": "Put it together",
    "foodimage": "https://th.bing.com/th/id/R.96ff46d3fd754c4c940006baa34ac37b?rik=QtW1piMQSCQJBw&pid=ImgRaw&r=0",
    "foodtype": "american"
  },
  {
    "foodname": "Stir-Fried Lo Mein Noodles",
    "ingredients": [
      "Kosher salt",
      "fresh lo mein noodles",
      "boneless pork ribs",
      "baking soda",
      "sugar",
      "soy sauce",
      "oyster sauce",
      "balsamic vinegar",
      "toasted sesame oil",
      "Shaoxing rice wine",
      "Asian fish sauce",
      "cornstarch",
      "neutral oil",
      "knob fresh ginger",
      "garlic cloves",
      "4 scallions",
      "purple cabbage",
      "Chinese broccoli",
      "carrots ",
      "Toasted sesame seeds",
      "Sambal oelek"
    ],
    "instructions": "Bring a pot of salted water to a boil and cook noodles according to package directions, stirring regularly with tongs or long chopsticks, until al dente and separated. Drain noodles and set aside.\r\n\r\nAl dente and separated noodles draining inside colander \r\nSerious Eats / Qi Ai\r\nTrim pork of excess fat and cut into thin strips, about 1/4 inch wide by 2 inches long. In a bowl, stir together baking soda and 1/2 cup cold water. Add pork, stir until thoroughly coated, then let stand at room temperature for 15 minutes.\r\n\r\nPork cut into thin strips and pork stirred into baking soda mixture\r\nSerious Eats / Qi Ai\r\nMeanwhile, in a medium bowl, whisk together sugar, soy sauce, oyster sauce, vinegar, sesame oil, wine, fish sauce, and cornstarch until sugar is dissolved. Set sauce aside.\r\n\r\nSugar, soy sauce, oyster sauce, vinegar, sesame oil, wine, fish sauce, and cornstarch whisked together inside a medium bowl\r\nSerious Eats / Qi Ai\r\nDrain pork well, rinse with cold water, then pat dry with paper towels. Add pork back to rinsed and dried bowl. Stir in 2 tablespoons (15ml) of the sauce and mix well.\r\n\r\nRinsing pork with cold water inside colander and pork mixed with sauce\r\nSerious Eats / Qi Ai\r\nIn a wok or large cast iron skillet, heat 1 tablespoon (15ml) neutral oil over medium-high heat until shimmering. Add ginger, garlic, and white scallion pieces and stir-fry for 30 seconds. Increase heat to high and add purple cabbage, Chinese broccoli (or Napa cabbage), and carrots. Cook, stirring and tossing, until vegetables are charred in spots and just softened, 3 to 5 minutes. Transfer to a plate.\r\n\r\nPurple cabbage, Chinese broccoli, and carrots added to ginger, garlic, and white scallion pieces inside wok\r\nSerious Eats / Qi Ai\r\nAdd 1 tablespoon (15ml) neutral oil to wok or skillet and heat over high heat until smoking. Add pork, spreading it out in a single layer, and let cook on one side until crisp and brown, 2 to 3 minutes. Continue to cook, stirring and tossing, until just cooked through, about 1 minute longer. Transfer to plate with vegetables.\r\n\r\nPork spread out in a single layer over oil inside wok and pork cooked through inside wok\r\nSerious Eats / Qi Ai\r\nWipe out wok or skillet, then add remaining 1 tablespoon (15ml) neutral oil and heat over high heat until smoking. Add noodles and cook, tossing and stirring, until hot.\r\n\r\nNoodles stirred inside wok over high heat\r\nSerious Eats / Qi Ai\r\nAdd remaining sauce, vegetables, and pork to noodles and toss well over heat to combine. Transfer lo mein to a platter and sprinkle sliced green scallions all over, along with sesame seeds, if using. Serve right away, passing sambal oelek at the table if desired.",
    "foodimage": "https://th.bing.com/th/id/OIP.strkaEXFTW1Bvpk_NxnHtgHaE7?rs=1&pid=ImgDetMain",
    "foodtype": "chinese"
  },
  {
    "foodname": "dskgh",
    "ingredients": "hlk;iohoihpuioh",
    "instructions": "l;ypuoh",
    "foodimage": "",
    "foodtype": "iuhuoh"
  }
]